{
  "basic_info": {
    "description_header": "Hi",
    "description": "I'm Rohullah Noory, a passionate software developer and a proud graduate of the Software Engineering Technology program from Conestoga College. My journey into software development began when a professor compared it to magic, explaining how users see what happens without understanding the intricate processes behind it. This analogy sparked my curiosity and drove me to explore the world of software development, a curiosity that continues to fuel my growth and learning every day. One of my proudest achievements is winning Conestoga's Mastercraft award for my capstone project, recognized as the best among over 20 programs. While I primarily focus on frontend technologies, I also have experience working with backend development, giving me a well-rounded perspective on building comprehensive solutions. Outside of web development, I enjoy working out and reading, which helps me maintain a balanced and motivated lifestyle. I'm excited to continue my journey in the tech world, constantly striving to create seamless and impactful user experiences.",
    "section_name": {
      "about": "About me",
      "projects": "Projects",
      "skills": "Skills",
      "experience": "Experience"
    }
  },
  "projects": [
    {
      "title": "Expense Tracker",
      "startDate": "2024",
      "description": "A simple Expense Tracker application designed to help users manage their finances with ease and efficiency. Built using the MERN stack (MongoDB, Express, React, Node.js) and GraphQL, this application allows users to track their income, expenses, and investments in real-time. With an intuitive and user-friendly interface, users can easily add, edit, and delete transactions, categorize expenses, and visualize their spending patterns through an interactive chart. The application also features a secure authentication system to ensure user data privacy. Whether you're looking to budget better, save more, or simply keep a closer eye on your financial health, Expense Tracker application provides all the basic features to support your financial goals.",
      "images": [
        "images/portfolio/expense-tracker/ETHomePage.JPG",
        "images/portfolio/expense-tracker/ETLogin.JPG"
      ],
      "liveDemoUrl": "https://github.com/rohullahN/Expense-Tracker",
      "sourceCodeUrl": "https://github.com/rohullahN/Expense-Tracker",
      "technologies": [
        {
          "class": "devicon-mongodb-plain",
          "name": "MongoDB"
        },
        {
          "class": "devicon-express-original",
          "name": "Express"
        },
        {
          "class": "devicon-react-original",
          "name": "React"
        },
        {
          "class": "devicon-nodejs-plain",
          "name": "NodeJS"
        },
        {
          "class": "devicon-tailwindcss-original",
          "name": "Tailwind"
        },
        {
          "class": "devicon-graphql-plain",
          "name": "GraphQL"
        }
      ]
    },
    {
      "title": "TrackrFC",
      "startDate": "2024",
      "description": "TrackrFC is an innovative soccer analytics tool that empowers club-level teams with advanced game analysis capabilities. Utilizing state-of-the-art computer vision and AI technologies, this platform allows users to upload game footage and receive comprehensive insights. Coaches and teams can explore player and ball movements on a tactical 2D map, access crucial statistics like possession, player positioning, and pass accuracy, and utilize the tactical board tool for strategic planning. Designed to be user-friendly and affordable, TrackrFC democratizes professional-grade analytics, making it an essential tool for teams seeking to enhance performance and gain a competitive edge. Awarded the prestigious Conestoga Mastercraft Award for excellence in project execution, beating out over 20 programs in engineering and IT.",
      "images": [
        "images/portfolio/trackrfc/TrackrFC.png",
        "images/portfolio/trackrfc/TFChomepage.png"
      ],
      "liveDemoUrl": "https://www.youtube.com/watch?v=fo7wlEW5giI",
      "technologies": [
        {
          "class": "devicon-react-original",
          "name": "React"
        },
        {
          "class": "devicon-typescript-plain",
          "name": "TypeScript"
        },
        {
          "class": "devicon-socketio-original",
          "name": "SocketIO"
        },
        {
          "class": "devicon-flask-original",
          "name": "Flask"
        },
        {
          "class": "devicon-mysql-original",
          "name": "MySQL"
        },
        {
          "class": "devicon-opencv-plain",
          "name": "OpenCV"
        }
      ]
    },
    {
      "title": "Transportation Management System",
      "startDate": "2021",
      "description": "A Logistics Windows App which allows purchasing, scheduling, monitoring and billing of organizations who desire to have cargo shipped via truck or train across Ontario, Canada. This application was built using C# and WPF (.Net Framework), with its database supported by MySQL, where all the data about carriers, contracts, users, clients, trips, and invoices are stored, following best practices.",
      "images": [
        "images/portfolio/TMS/TMS.png",
        "images/portfolio/TMS/TMSadminPage.png"
      ],
      "liveDemoUrl": "https://www.youtube.com/watch?v=fmqJGEqpZvI",
      "sourceCodeUrl": "https://github.com/rohullahN/Transportation-Management-System?tab=readme-ov-file",
      "technologies": [
        {
          "class": "devicon-csharp-plain",
          "name": "C#"
        },
        {
          "class": "devicon-dotnetcore-plain",
          "name": ".NET"
        },
        {
          "class": "devicon-mysql-original",
          "name": "MySQL"
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "Vehikl Inc.",
      "title": "Software Developer",
      "years": "01.2023 - 04.2024",
      "mainTech": ["React", "PHP", "C#"],
      "technologies": [
        "TypeScript",
        "React Native",
        "REST API",
        "JavaScript",
        ".NET",
        "Jest",
        "PHPUnit",
        "Git"
      ]
    },
    {
      "company": "Delta Elevator Co Ltd",
      "title": "Co-op - IS Programmer",
      "years": "05.2022 - 12.2022",
      "mainTech": ["C#"],
      "technologies": ["VB.NET", "Entity Framework", "xUnit", "Git"]
    }
  ]
}
